{"vocab": ["air", "amethyst_block", "amethyst_cluster", "andesite", "azalea", "azure_bluet", "barrel", "bee_nest", "big_dripleaf", "big_dripleaf_stem", "birch_leaves", "birch_log", "blue_ice", "bone_block", "brown_mushroom", "bubble_column", "budding_amethyst", "bush", "calcite", "cave_air", "cave_vines", "cave_vines_plant", "chest", "chiseled_stone_bricks", "chiseled_tuff", "chiseled_tuff_bricks", "clay", "coal_ore", "cobblestone", "cobblestone_wall", "cobweb", "copper_ore", "cornflower", "cracked_stone_bricks", "crying_obsidian", "dandelion", "dark_oak_fence", "dark_oak_log", "dark_oak_planks", "dark_oak_slab", "dark_oak_stairs", "deepslate", "deepslate_coal_ore", "deepslate_copper_ore", "deepslate_diamond_ore", "deepslate_emerald_ore", "deepslate_gold_ore", "deepslate_iron_ore", "deepslate_lapis_ore", "deepslate_redstone_ore", "diamond_ore", "diorite", "dirt", "dirt_path", "dispenser", "dripstone_block", "emerald_ore", "fern", "firefly_bush", "flowering_azalea", "furnace", "glass_pane", "glow_lichen", "gold_ore", "granite", "grass_block", "gravel", "hopper", "ice", "infested_deepslate", "infested_stone", "iron_chain", "iron_ore", "kelp", "kelp_plant", "lantern", "lapis_ore", "large_amethyst_bud", "large_fern", "lava", "leaf_litter", "lilac", "lily_of_the_valley", "magma_block", "medium_amethyst_bud", "moss_block", "moss_carpet", "mossy_cobblestone", "mossy_stone_bricks", "netherrack", "oak_button", "oak_fence", "oak_leaves", "oak_log", "oak_planks", "obsidian", "other", "oxeye_daisy", "packed_ice", "peony", "pointed_dripstone", "polished_granite", "polished_tuff", "polished_tuff_slab", "poppy", "powder_snow", "pumpkin", "rail", "raw_copper_block", "red_candle", "red_glazed_terracotta", "red_mushroom", "redstone_ore", "rose_bush", "sand", "sandstone", "sculk", "sculk_catalyst", "sculk_sensor", "sculk_shrieker", "sculk_vein", "seagrass", "short_grass", "small_amethyst_bud", "small_dripleaf", "smooth_basalt", "snow", "snow_block", "spawner", "spore_blossom", "spruce_door", "spruce_fence", "spruce_leaves", "spruce_log", "spruce_planks", "spruce_slab", "spruce_stairs", "stone", "stone_brick_slab", "stone_brick_stairs", "stone_bricks", "stripped_spruce_wood", "sugar_cane", "suspicious_gravel", "sweet_berry_bush", "tall_grass", "tall_seagrass", "trial_spawner", "tuff", "tuff_bricks", "vault", "vine", "wall_torch", "water", "waxed_chiseled_copper", "waxed_copper_block", "waxed_copper_bulb", "waxed_copper_grate", "waxed_cut_copper", "waxed_cut_copper_slab", "waxed_exposed_copper_bulb", "waxed_oxidized_copper", "waxed_oxidized_copper_bulb", "waxed_oxidized_copper_grate", "waxed_oxidized_copper_trapdoor", "waxed_oxidized_cut_copper", "waxed_oxidized_cut_copper_stairs", "waxed_weathered_copper_bulb", "wildflowers"], "block2id": {"air": 0, "amethyst_block": 1, "amethyst_cluster": 2, "andesite": 3, "azalea": 4, "azure_bluet": 5, "barrel": 6, "bee_nest": 7, "big_dripleaf": 8, "big_dripleaf_stem": 9, "birch_leaves": 10, "birch_log": 11, "blue_ice": 12, "bone_block": 13, "brown_mushroom": 14, "bubble_column": 15, "budding_amethyst": 16, "bush": 17, "calcite": 18, "cave_air": 19, "cave_vines": 20, "cave_vines_plant": 21, "chest": 22, "chiseled_stone_bricks": 23, "chiseled_tuff": 24, "chiseled_tuff_bricks": 25, "clay": 26, "coal_ore": 27, "cobblestone": 28, "cobblestone_wall": 29, "cobweb": 30, "copper_ore": 31, "cornflower": 32, "cracked_stone_bricks": 33, "crying_obsidian": 34, "dandelion": 35, "dark_oak_fence": 36, "dark_oak_log": 37, "dark_oak_planks": 38, "dark_oak_slab": 39, "dark_oak_stairs": 40, "deepslate": 41, "deepslate_coal_ore": 42, "deepslate_copper_ore": 43, "deepslate_diamond_ore": 44, "deepslate_emerald_ore": 45, "deepslate_gold_ore": 46, "deepslate_iron_ore": 47, "deepslate_lapis_ore": 48, "deepslate_redstone_ore": 49, "diamond_ore": 50, "diorite": 51, "dirt": 52, "dirt_path": 53, "dispenser": 54, "dripstone_block": 55, "emerald_ore": 56, "fern": 57, "firefly_bush": 58, "flowering_azalea": 59, "furnace": 60, "glass_pane": 61, "glow_lichen": 62, "gold_ore": 63, "granite": 64, "grass_block": 65, "gravel": 66, "hopper": 67, "ice": 68, "infested_deepslate": 69, "infested_stone": 70, "iron_chain": 71, "iron_ore": 72, "kelp": 73, "kelp_plant": 74, "lantern": 75, "lapis_ore": 76, "large_amethyst_bud": 77, "large_fern": 78, "lava": 79, "leaf_litter": 80, "lilac": 81, "lily_of_the_valley": 82, "magma_block": 83, "medium_amethyst_bud": 84, "moss_block": 85, "moss_carpet": 86, "mossy_cobblestone": 87, "mossy_stone_bricks": 88, "netherrack": 89, "oak_button": 90, "oak_fence": 91, "oak_leaves": 92, "oak_log": 93, "oak_planks": 94, "obsidian": 95, "other": 96, "oxeye_daisy": 97, "packed_ice": 98, "peony": 99, "pointed_dripstone": 100, "polished_granite": 101, "polished_tuff": 102, "polished_tuff_slab": 103, "poppy": 104, "powder_snow": 105, "pumpkin": 106, "rail": 107, "raw_copper_block": 108, "red_candle": 109, "red_glazed_terracotta": 110, "red_mushroom": 111, "redstone_ore": 112, "rose_bush": 113, "sand": 114, "sandstone": 115, "sculk": 116, "sculk_catalyst": 117, "sculk_sensor": 118, "sculk_shrieker": 119, "sculk_vein": 120, "seagrass": 121, "short_grass": 122, "small_amethyst_bud": 123, "small_dripleaf": 124, "smooth_basalt": 125, "snow": 126, "snow_block": 127, "spawner": 128, "spore_blossom": 129, "spruce_door": 130, "spruce_fence": 131, "spruce_leaves": 132, "spruce_log": 133, "spruce_planks": 134, "spruce_slab": 135, "spruce_stairs": 136, "stone": 137, "stone_brick_slab": 138, "stone_brick_stairs": 139, "stone_bricks": 140, "stripped_spruce_wood": 141, "sugar_cane": 142, "suspicious_gravel": 143, "sweet_berry_bush": 144, "tall_grass": 145, "tall_seagrass": 146, "trial_spawner": 147, "tuff": 148, "tuff_bricks": 149, "vault": 150, "vine": 151, "wall_torch": 152, "water": 153, "waxed_chiseled_copper": 154, "waxed_copper_block": 155, "waxed_copper_bulb": 156, "waxed_copper_grate": 157, "waxed_cut_copper": 158, "waxed_cut_copper_slab": 159, "waxed_exposed_copper_bulb": 160, "waxed_oxidized_copper": 161, "waxed_oxidized_copper_bulb": 162, "waxed_oxidized_copper_grate": 163, "waxed_oxidized_copper_trapdoor": 164, "waxed_oxidized_cut_copper": 165, "waxed_oxidized_cut_copper_stairs": 166, "waxed_weathered_copper_bulb": 167, "wildflowers": 168}}